sylabus = {
    "Лабораторні роботи": {
        "Лабораторна робота 1": 2,
        "Лабораторна робота 2": 2,
        "Лабораторна робота 3": 2,
        "Лабораторна робота 4": 2,
        "Лабораторна робота 5": 2,
        "Лабораторна робота 6": 2,
        "Лабораторна робота 7": 2,
        "Лабораторна робота 8": 2,
        "Лабораторна робота 9": 2,
        "Лабораторна робота 10": 2,
        "Лабораторна робота 11": 2
    },
    "Проміжний іспит": {
        "Теоретичне завдання": 5,
        "Завдання на програмування": 15
    },
    "Тести по лекційним матеріалам": {
        "Тест 1": 0.5,
        "Тест 2": 0.5,
        "Тест 3": 0.5,
        "Тест 4": 0.5,
        "Тест 5": 0.5,
        "Тест 6": 0.5
    },


    "Тести на LMS": {
        "Тест 1": 0.3,
        "Тест 2": 0.3,
        "Тест 3": 0.3,
        "Тест 4": 0.3,
        "Тест 5": 0.3,
        "Тест 6": 0.3,
        "Тест 7": 0.3,
        "Тест 8": 0.3,
        "Тест 9": 0.3,
        "Тест 10": 0.3
    },


    "Міні-проєкти": {
        "Міні-проєкт 1": 12,
        "Міні-проєкт 2": 10
    },


    "Фінальний іспит": {
        "Теоретичне завдання": 8,
        "Завдання на програмування": 22

    },


    "Додаткові бали": {}
}


import json

with open("sylabus.json", "w", encoding="ascii") as f:
    json.dump(sylabus, f)

with open('sylabus.json', encoding='ascii') as f:
    data = json.load(f)
print(data)
